namespace War.Weapons {

    public enum WeaponState1 {

        Targeting1, // ждем отпускания лкм
        Targeting2, // ждем нажатия лкм
        Ready1,
        Ready2,
        Charging,
        Shooting

    }


    public enum WeaponState2 {

        Initial,
        JustEquipped,
        Ready,
        Charging,
        Shooting,
        Final,
        Unequipping,

    }
    
    
    /*
    **  кароч, сделаю отдельно анимации, состояния и события
    **  состояния и анимации енумами а события методами
    **  
    **  состояния:
    **      не выбрано
    **      можно стрелять
    **      регулировка
    **      стрельба
    **      убрано
    **  
    **  анимации:
    **      доставание
    **      регулировка
    **      бездействие
    **      начало атаки
    **      выстрел
    **      конец атаки
    **      убирание
    **  
    **  события:
    **      выбор в арсенале
    **      доставание
    **      смена режима
    **      червяка толкнули
    **      атака
    **      завершение регулировки
    **      выстрел
    **      последний выстрел атаки
    **      последний выстрел последней атаки
    **      убирание оружия
    */


    public enum WeaponState {

        Initial,            // исходное
        NotEquipped,        // не знаю что это за состояние, возможно когда червяк не может стрелять по причине того
                            // что его сбили с ног и он не может управлять оружием
        Ready,              // это состояние до стрельбы, когда виден прицел и при нажатии будет начата атака
                            // если оружие имеет возможность наведения на цель, я хз
        Charging,           // регулировка силы, игра на паузе, видно кольцо на прицеле
        Warmup,             // задержка перед атакой, пауза, видно кольцо, проигрывается анимация
        ShotCooldown,       // задержка после выстрела, пауза, видно кольцо
        Cooldown,           // задержка после атаки, пауза, видно прицел, при убирании меняется в last cooldown
                            // с тем же таймером
                            // но при каких условиях мы можем убрать его во время паузы?
        CancelableCooldown, // тоже пауза, но можно атаковать
                            // однако на практике почему-то не атакуется
                            // что это за состояние и во что оно отменяется?
                            // ага lastcooldown не канселится в unequipping
                            // короче моя догадка это то что есть частный случай когда игрок жмет убрать оружие
                            // у которого несколько атак
                            // типа cooldown и lastcooldown всегда одинаковые и при убирании заменят друг друга
                            // а cancelablecooldown отменится сразу в unequipping
                            // и назначение у него это сделать паузу между атаками чтобы успеть среагировать
        LastCooldown,       // включается последним выстрелом, нет паузы, нет прицела, не канселится в unequipping
                            // при каких условиях опять же?
        Unequipping,        // анимация убирания, включается если оружие убирается или игрок (коммент не был дописан)
        Final,              // ничего нет и перейти никуда нельзя
        
        
        // значит для авиаударов будут состояния ready, warmup, lastcooldown и unequipping

    }

}