using System.Collections.Generic;


namespace OldWar {

    public static class WormsNames {

        public static readonly IReadOnlyList <string> Names = new [] {
            // пачотные нупы с нупскими именами (некоторые повторяются)
            //    //    //    //    //    //    //    //    //    //    //    //    //    //    //
            "Раден",    "Рашка",    "Клем",     "Тарг",     "Драшка",   "Гугр",     "Санджы",
            "Спуди",    "Питон",    "Царь Носок",           "Мелк",     "Гамаз",
            // кобешники
            "Мако",     "Кирс",     "СРГС",     "Артющ",
            // затралиные мастиры
            "Лалксайд", "Твая мамка",
            // другие люди
            "Рыж",      "Шавукен",  "Шарло",    "Ахмид",    "Гуф",      "Травокур",
            // приколы и мемы
            "Бутмин",   "Супирман", "Хулк",     "Торч",     "Имба",     "Ваншот",   "Васян",
            "Лойс",     "Дизлойс",  "Кряк",     "База",     "Кринж",    "Шлёпа",    "Гигачад",
            "Баг", // на самом деле это фича
            "Горшок",   "Гульмэн",  "Нагибатор",            "Синий кит",            "Тест",
            "Амогус",   "Школотрон",
            // локальные мемы которые никто не знает
            "Осташок",  "Бутрахит", "Вженкинс", "Бровастик",            "Пукановзрыватель",
            "Ручейник", "Синий гриб",           "Кекич",    "Трарт",    "Ллалл",    "Бунт",
            "Меш",      "Тайфунчик",            "Рокетдайв",
            // персонажи и мемы из днд
            "Егерь",    "Тихомир",  "Илларион", "Сверчок",  "Вестник рака",         "Колян",
            "Вальтер",  "Шизомув",  "Магочух",
        };

    }

}
