namespace War.OldWeapons {

    public enum WeaponState {

        Idle1,          // исходное состояние, ждем отпускания лкм
        Idle2,          // по нажатию лкм указываем цель/стреляем
        TargetSet1,     // цель задана, ждем отпускания лкм
        TargetSet2,     // цель задана, по нажатию лкм стреляем
        AdjustingPower, // регулировка силы выстрела
        Shooting        // атака, прекращается по таймеру, включает все задержки до и после выстрелов
        
        // кнопку таб не используем, все оружие будет через цифры
        // таймер гранат 1-5, авиаудары 1-2, магниты 1-2, балки 1-4 и т.д. все на цифры

    }

}
