namespace War.Entities {

    public class GlueBlob {

        /* На первое время надо сделать хотя бы чтобы
         * червяки приклеивались.
         * Механика такая:
         *  если червяк задевает клей, то:
         *   мы подкручиваем коэффициенты трения ему на липкость
         *   при столкновении с землей он приклеивается
         *   при столкновении с червяком он делает его липким тоже
         *  приклеенный червяк не может:
         *   ползать
         *   прыгать
         *   использовать утилиты для перемещения
         *  приклеивание снимается, если:
         *   червяк телепортируется
         *   рядом с червяком нет земли, к которой он приклеен
         *   червяк получает урон от огня
         */

    }

}
